[
  {
    "title": "PETIFY",
    "about": "A modern pet adoption and donation platform enabling seamless pet adoption, donation campaigns, secure Stripe payments, and animal welfare with a modern UI, secure authentication, and real-time features for users and admins.",
    "technology": ["React", "Firebase", "MongoDB", "Express", "Stripe", "Tailwind CSS"],
    "thumb_img": "https://i.postimg.cc/9MVNRdgF/petify.jpg",
    "live": "https://petify-us.web.app",
    "client": "https://github.com/omarfaruk-dev/petify-client.git",
    "server": "https://github.com/omarfaruk-dev/petify-server.git",
    "description": "Petify is a full-stack web app built with the MERN stack (MongoDB, Express.js, React, Node.js), Vite, Tailwind CSS, and Firebase—enabling seamless pet adoption, donation campaigns, secure Stripe payments, and animal welfare with a modern UI, secure authentication, and real-time features for users and admins.",
    "challenges": "Integrating Stripe payment gateway for secure donation processing and handling complex payment flows with proper error handling and webhook management. Implementing comprehensive role-based authentication and authorization system for users and admins with different permission levels and secure access controls.",
    "overcome": "I overcame the Stripe integration challenge by implementing proper webhook handling, error management, and using Stripe's test mode for development. For role-based authentication, I created a middleware system with JWT tokens and Firebase Admin SDK to manage different user roles and permissions effectively."
  },
  {
    "title": "ROOMLY",
    "about": "Roomly helps users find and manage roommates. Create profiles, browse listings, and filter matches by preferences, budget, and location.",
    "technology": ["React", "Firebase", "MongoDB", "Express"],
    "thumb_img": "https://i.postimg.cc/FFgSc08t/roomly.jpg",
    "live": "https://roomly-app.netlify.app",
    "client": "https://github.com/omarfaruk-dev/roomly-client.git",
    "server": "https://github.com/omarfaruk-dev/roomly-server.git",
    "description": "Roomly is a comprehensive roommate finder and shared housing platform that connects users based on lifestyle preferences, budget, and location. The app allows users to create detailed profiles, search and filter listings, chat securely with potential roommates, and manage shared expenses and tasks. Roomly's intuitive interface and advanced matching algorithm make it easy to find compatible roommates and manage co-living arrangements efficiently.",
    "challenges": "Building a robust real-time chat and notification system for seamless communication. Designing and implementing a smart matching algorithm to suggest compatible roommates. Ensuring user privacy and security, including profile verification and secure messaging. Handling complex search and filter queries efficiently for large datasets. Managing shared expenses and tasks with real-time updates and notifications. Creating a responsive, accessible UI that works well on both desktop and mobile devices."
  },
  {
    "title": "FOODIO",
    "about": "A restaurant management application where restaurant owners can sell foods and customers can order and manage their meals quickly.",
    "technology": ["React", "Firebase", "MongoDB", "Express"],
    "thumb_img": "https://i.postimg.cc/d0sNPGXG/foodio.jpg",
    "live": "https://foodi0.web.app",
    "client": "https://github.com/omarfaruk-dev/foodio-client",
    "server": "https://github.com/omarfaruk-dev/foodio-server",
    "description": "Foodio is a full-featured restaurant management and online food ordering platform designed for both restaurant owners and customers. Restaurant owners can manage menus, track orders, and analyze sales, while customers can browse menus, place orders, and make secure payments. Foodio supports real-time order tracking, role-based dashboards for admins, staff, and customers, and seamless communication between all parties. The platform is optimized for both desktop and mobile, ensuring a smooth experience for all users.",
    "challenges": "Implementing real-time order tracking and status updates for both customers and restaurant staff. Designing flexible, role-based dashboards to accommodate admins, staff, and customers with different permissions and views. Integrating secure payment gateways and ensuring PCI compliance. Managing complex menu structures, customizations, and dynamic pricing. Handling high concurrency and ensuring data consistency during peak order times. Creating a responsive, intuitive UI that works seamlessly across devices."
  },
  {
    "title": "QUICK PAY",
    "about": "Quick Pay lets users pay bills instantly. Manage payments, view history, and enjoy a secure, user-friendly experience for all your transactions.",
    "technology": ["React", "Firebase", "tailwindcss"],
    "thumb_img": "https://i.ibb.co.com/7tVdwh6x/quick-pay-mockup.jpg",
    "live": "https://quick-pay-bd.netlify.app",
    "client": "https://github.com/omarfaruk-dev/quick-pay.git",
    "server": "https://github.com/omarfaruk-dev/quick-pay.git",
    "description": "Quick Pay is a modern, secure, and user-friendly payment application designed to simplify online transactions. It allows users to send and receive money instantly, manage their transaction history, and connect multiple payment methods. The app features a clean interface, real-time notifications, and robust security measures to ensure safe and seamless payments for both individuals and businesses.",
    "challenges": "Integrating multiple payment gateways and ensuring compatibility across platforms. Implementing robust security features (encryption, fraud detection, secure authentication). Handling real-time transaction updates and notifications. Designing a user interface that is both intuitive and accessible for a wide range of users. Ensuring compliance with financial regulations and data privacy standards. Managing error handling and edge cases for failed or delayed transactions."
  }
]
