[
  {
    "title": "Ridex - (Team Project)",
    "about": "A Ride-sharing platform offering seamless transportation via bike, car, and CNG with real-time driver matching, secure authentication. Ridex ensures fast, safe, and reliable travel experiences, location tracking, and real time notification.",
    "technology": [
      "NextJs",
      "Express",
      "MongoDB",
      "Socket.io",
      "Tailwind CSS",
      "Shadcn UI",
      "Gemini AI",
      "JWT"
    ],
    "thumb_img": "https://i.postimg.cc/BbWN8dzq/Ridex-l.png",
    "landing_page": "https://your-image-url.com/ridex-landing-page.png",
    "live": "https://ridex-ride-sharing.vercel.app",
    "client": "https://github.com/rubel6610/RideX-Frontend",
    "server": "https://github.com/rubel6610/ridex-backend",
    "description": "Ridex is a full-stack ride-sharing web application built with NextJs, Express.js, MongoDB and Socket.io. It enables users to book rides instantly, track riders in real-time, and manage ride history with secure authentication and role-based access. The platform also features AI-powered chatbot support and an AI blog generator for enhanced user engagement.",
    "challenges": "Implementing real-time ride notifications, rider live tracking system, and integrating AI tools for chatbot support and blog generation. Ensuring smooth socket communication and scalable architecture for concurrent ride sessions and AI-driven interactions.",
    "overcome": "I overcame the real-time notification and tracking challenge by using Socket.IO and geospatial queries to push live ride updates and rider locations. For AI features, I integrated chatbot APIs and built a custom blog generator using prompt engineering and content pipelines. The live chat system between riders and drivers was implemented using WebSocket with efficient message routing and session management.",
    "PotentialImprovementsAndFuturePlans": "I plan to introduce voice-based ride booking, multilingual support for broader accessibility, and a loyalty rewards system for frequent users. Future updates may include AI-powered ride suggestions based on user behavior and predictive demand mapping for drivers."
  },
  {
    "title": "PETIFY",
    "about": "A modern pet adoption and donation platform enabling seamless pet adoption, donation campaigns, secure Stripe payments, and animal welfare with a modern UI, secure authentication, and real-time features for users and admins.",
    "technology": [
      "React",
      "Firebase",
      "MongoDB",
      "Express",
      "Stripe",
      "Tailwind CSS"
    ],
    "thumb_img": "https://i.postimg.cc/9MVNRdgF/petify.jpg",
    "landing_page": "https://i.postimg.cc/85qB2pCk/petify-landing-page-original.png",
    "live": "https://petify-us.web.app",
    "client": "https://github.com/omarfaruk-dev/petify-client.git",
    "server": "https://github.com/omarfaruk-dev/petify-server.git",
    "description": "Petify is a full-stack web app built with the MERN stack (MongoDB, Express.js, React, Node.js), Vite, Tailwind CSS, and Firebase—enabling seamless pet adoption, donation campaigns, secure Stripe payments, and animal welfare with a modern UI, secure authentication, and real-time features for users and admins.",
    "challenges": "Integrating Stripe payment gateway for secure donation processing and handling complex payment flows with proper error handling and webhook management. Implementing comprehensive role-based authentication and authorization system for users and admins with different permission levels and secure access controls.",
    "overcome": "I overcame the Stripe integration challenge by implementing proper webhook handling, error management, and using Stripe's test mode for development. For role-based authentication, I created a middleware system with JWT tokens and Firebase Admin SDK to manage different user roles and permissions effectively.",
    "PotentialImprovementsAndFuturePlans": "I plan to add a chat feature for users to communicate with each other, and a blog section for users to share their stories and experiences with pets."
  },
  {
    "title": "FOODIO",
    "about": "A modern, visually appealing restaurant management web application built with React, Vite, and Tailwind CSS offering seamless experience for discovering, ordering, and managing favorite meals with beautiful UI and robust functionality.",
    "technology": [
      "React",
      "Firebase",
      "MongoDB",
      "Express",
      "Tailwind CSS"
    ],
    "thumb_img": "https://i.postimg.cc/d0sNPGXG/foodio.jpg",
    "landing_page": "https://i.postimg.cc/fW20tgKs/foodio-landing-page.png",
    "live": "https://foodi0.web.app",
    "client": "https://github.com/omarfaruk-dev/foodio-client",
    "server": "https://github.com/omarfaruk-dev/foodio-server",
    "description": "Foodio is a comprehensive food delivery platform featuring an eye-catching hero slider, infinite scroll gallery, customer reviews, detailed food cards, and secure user authentication. The app includes profile management, order tracking, vendor admin features for food management, and responsive navigation with dark/light theme toggle.",
    "challenges": "Managing food availability and stock tracking to ensure accurate order processing and prevent overselling of items. Implementing a comprehensive order management system that displays order history, status tracking.",
    "overcome": "I overcame the stock management challenge by implementing real-time inventory tracking with MongoDB updates and preventing orders when items are out of stock. For the order management system, I created a comprehensive order page that displays order history and status updates between inventory and order processing.",
    "PotentialImprovementsAndFuturePlans": "Add real-time chat, push notifications, and role based dashboard page for admins and users."
  },
  {
    "title": "ROOMLY",
    "about": "A modern web application for finding and listing roommates and rooms, designed for trust, privacy, and real connections with seamless browsing, searching, and secure authentication features.",
    "technology": [
      "React",
      "Firebase",
      "MongoDB",
      "Express",
      "Tailwind CSS",
      "DaisyUI"
    ],
    "thumb_img": "https://i.postimg.cc/FFgSc08t/roomly.jpg",
    "landing_page": "https://i.postimg.cc/fW20tgKs/foodio-landing-page.png",
    "live": "https://roomly-app.netlify.app",
    "client": "https://github.com/omarfaruk-dev/roomly-client.git",
    "server": "https://github.com/omarfaruk-dev/roomly-server.git",
    "description": "Roomly is a comprehensive roommate finder and shared housing platform that connects users based on lifestyle preferences, budget, and location. The app allows users to create detailed profiles, search and filter listings, like listings to reveal contact details, and manage their own listings with secure authentication and responsive design.",
    "challenges": "Implementing secure user authentication and profile management with Firebase while ensuring data privacy and user verification. Creating an intuitive listing system with search, filter, and like functionality that efficiently handles large datasets and provides smooth user interactions.",
    "overcome": "I overcame the authentication challenge by implementing Firebase Authentication with Google sign-in, proper session management using React Context, and secure user profile creation. For the listing system, I built efficient MongoDB aggregation pipelines for search and filtering, and implemented a like-based contact reveal mechanism that protects user privacy while enabling connections.",
    "PotentialImprovementsAndFuturePlans": "Push notifications and an admin feature allowing admins to promote any user to admin status for enhanced management."
  }
]